{
  "2.0.0": {
    "banner": "https://github.com/arg0NNY/BetterAnimations/raw/refs/heads/main/assets/V2.webp",
    "blurb": "Larger, faster, and rebuilt from the ground up. **BetterAnimations 2.0** is here, transforming your Discord experience with a new generation of silky-smooth, deeply integrated animations.",
    "changes": [
      {
        "type": "added",
        "title": "What's New in 2.0",
        "items": [
          "🎭 **Expanded Animation Library** — experience motion across Discord like never before. This release introduces 10 new animation modules, bringing the total to 14. Animate everything from Servers and Messages to the Thread Sidebar and Modals.",
          "⚙️ **Native-Level Integration** — animations are now woven directly into Discord's core UI. This creates a more reliable, rigid, and natural-feeling experience that truly belongs.",
          "🚀 **Unmatched Performance** — enjoy buttery-smooth animations that make Discord feel snappier and more responsive than ever.",
          "🎨 **Ultimate Customization** — take full control with a completely redesigned Settings Panel. Fine-tune every detail of your animations or craft entirely new ones from scratch.",
          "🌐 **Client Mod & Framework** — expand your library with community-made animations or build and share your own through the official Catalog."
        ]
      }
    ]
  },
  "2.0.1": {
    "changes": [
      {
        "type": "added",
        "title": "What's new",
        "items": [
          "Enhance layout: Added alert when conflict with the custom theme is detected."
        ]
      },
      {
        "type": "fixed",
        "title": "Fixes",
        "items": [
          "General Settings: Updated to work in the latest release of Discord."
        ]
      }
    ]
  },
  "2.0.2": {
    "changes": [
      {
        "type": "fixed",
        "title": "Fixes",
        "items": [
          "Fixed the plugin failing to load."
        ]
      }
    ]
  },
  "2.0.3": {
    "changes": [
      {
        "type": "fixed",
        "title": "Fixes",
        "items": [
          "Updated to work in the latest release of Discord."
        ]
      }
    ]
  },
  "2.0.4": {
    "changes": [
      {
        "type": "fixed",
        "title": "Fixes",
        "items": [
          "Updated to work in the latest release of Discord."
        ]
      }
    ]
  },
  "2.0.5": {
    "changes": [
      {
        "type": "fixed",
        "title": "Fixes",
        "items": [
          "Channels: Fixed the animation direction being incorrectly determined for the Quests page.",
          "Updated to work in the latest release of Discord."
        ]
      }
    ]
  },
  "2.0.6": {
    "changes": [
      {
        "type": "fixed",
        "title": "Fixes",
        "items": [
          "Modals Backdrop: Updated to work in the latest release of Discord."
        ]
      }
    ]
  },
  "2.0.7": {
    "changes": [
      {
        "type": "fixed",
        "title": "Fixes",
        "items": [
          "Settings: Updated to work in the latest release of Discord."
        ]
      }
    ]
  },
  "2.0.8": {
    "changes": [
      {
        "type": "fixed",
        "title": "Fixes",
        "items": [
          "Catalog & Library: Updated to work in the latest release of Discord."
        ]
      }
    ]
  }
}
